//Реалізуйте клас NSD, в privat зберігає два цілих числа.Реалізуйте конструктор за замовчування, який надає значення двох змінним 1;
//Реалізуйте конструктор, який приймає два  цілочисельних значення і обчислює НСД двох чисел; Реалізуйте функцію, яка обчислює НСК.
//Реалізуйте функцію, яка виводить два числа.
#include <iostream>
#include<Windows.h>
using namespace std;
class NSD
{
private:
    int m_a;
    int m_b;
public:
    int nsd = 0;//змінна для зберігання нсд
      NSD() {//конструктор за замовчування, який надає значення двох змінним 1
        m_a = 1;
        m_b = 1;
    }
    NSD(int m_a, int m_b) {//конструктор присвоєння значень і обчислення нсд
        this->m_a = m_a;
        this->m_b = m_b;
        while (m_a!= m_b) {//рахуєм НСД
            if (m_a > m_b) {
                m_a -= m_b; 
                nsd = m_a;
            }
            else {
                m_b -= m_a;
                nsd = m_b;
            }
        }
    }
    void NSK(){//Рахуєм НСК та виводим НСД і НСК
        int nsk = 0;//змінна для  нск
        nsk = (m_a *m_b) / nsd;
        cout <<"НСД двох чисел = "<< nsd <<endl;
        cout <<"НСК двох чисел = " << nsk << endl;
    }     
    void print() {//ф-н виводу числа
        cout << "Перше число  = " << m_a << " \nДруге число  = " << m_b << endl;       
    }
};
int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    NSD A(12, 8);
    A.print(); //виводим числа
    A.NSK();//виводим НСД та НСК
}
